#напишите программу которая на вход принимает число и ввыводит является ли число четным
a=input("ввидите число: ")
num1=int(a)
#проверяем четность числа
if num1%2==0:
    print("число четное")
else:
    print("число не четное")
